#define _CRT_SECURE_NO_WARNINGS 1 
#include <stdio.h>
#include <windows.h>
//int main() 
//{
//	char a = -128;
//	//-128 ---> 10000000 00000000 00000000 10000000  原码
//	//11111111 11111111 11111111 10000000
//	//存在char类型的a里面，只能存8位  --->  10000000
//	//%u打印，对a进行整形提升，符号位为1 
//	//11111111 11111111 11111111 10000000
//	printf("%u\n", a);   //无符号打印    结果就是4294967168
//	system("pause");
//	return 0;
//}




//int main()
//{
//	char a = 128;
//	//00000000 00000000 00000000 10000000
//	//%u打印，对a进行整形提升，虽然128是正数，符号位为0，但在转变为char类型时，所取
//	//的8位10000000，此时的符号位为1，所以在整形提升时，也全补1 
//	//11111111 11111111 11111111 10000000
//	printf("%u\n", a);
//	system("pause");
//	return 0;
//}


//int main()
//{
//	int i = -20;
//	//10000000 00000000 00000000 00010100 
//	//11111111 11111111 11111111 11101100   --->补码
//	unsigned int j = 10;
//	//00000000 00000000 00000000 00001010
//	//00000000 00000000 00000000 00001010   --->补码    
//	//正数原反补相同
//	//相加
//	//11111111 11111111 11111111 11110110   --->补码
//	//10000000 00000000 00000000 00001010   --->原码  ---> -10
//	printf("%d\n", i + j); //按照补码的形式进行运算，最后格式化为有符号的整数
//	system("pause");
//	return 0;
//}


//
//int main()
//{
//	unsigned int i;           //无符号整形 
//	for (i = 9; i >= 0; i--)     //i永远都不会小于0，所以会一直循环下去，
//	//9 8 7 6 5 4 3 2 1 0 4294967295 4294967294...
//	{
//		Sleep(100);
//		printf("%u\n", i);
//	}
//	system("pause");
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	//-1 -2 -3 ...  -127 -128 127 126 ... 2 1 0
//	printf("%d", strlen(a));    //结果是255
//	//strlen 到\0结束 即0
//	system("pause");
//	return 0;
//}

//int main()
//{
//	short num = 32767;
//	short int a = num + 1;
//	printf("%d\n", a);
//	//0111 1111 1111 1111 -> 1000 0000 0000 0000 //(系统直接识别为最小值，不进行解码)
//	system("pause");
//	return 0; 
//}


#include <stdio.h>
unsigned char i = 0;
int main()
{
	for (i = 0; i <= 255; i++)
	{
		printf("hello wolrd\n");
	}
	system("pause");
	return 0;
}